Revit 2024 API
CurtainGrid.GetPanelIds Method
 Gets all ElementIds of the panels of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ICollection<ElementId> GetPanelIds()
Visual Basic
Public Function GetPanelIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetPanelIds()
Return Value
The panel ElementIds
Remarks
 For curtain walls, the ElementIds in this set are of either Panel or Wall Elements. For curtain systems, ElementIds are of Panel Elements.
See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace